SOAP/soap_request_wBusApp.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:quer="http://schemas.hp.com/ucmdb/1/params/query" xmlns:typ="http://schemas.hp.com/ucmdb/1/types" xmlns:prop="http://schemas.hp.com/ucmdb/1/types/props">
   <soapenv:Header/>
   <soapenv:Body>
      <quer:executeTopologyQueryByName>
         <quer:cmdbContext>
            <typ:callerApplication>powershell</typ:callerApplication>
         </quer:cmdbContext>
         <quer:queryName>BusApp_Node_Resources</quer:queryName>
         <!--Optional:-->
         <quer:queryTypedProperties>
            <!--Zero or more repetitions:-->
               <prop:typedProperties>
               <prop:type>node</prop:type>
               <prop:properties>
                  <!--Optional:-->
                  <prop:propertiesList>
                     <!--1 or more repetitions:-->
                     <prop:propertyName>display_label</prop:propertyName>
                     <prop:propertyName>primary_dns_name</prop:propertyName>  
                     <prop:propertyName>default_gateway_ip</prop:propertyName> 
                     <prop:propertyName>dns_servers</prop:propertyName>
                     <prop:propertyName>memory_size</prop:propertyName>
                     <prop:propertyName>swap_memory_size</prop:propertyName>
                     <prop:propertyName>node_osrelease</prop:propertyName>
                     <prop:propertyName>discovered_os_version</prop:propertyName>
                     <prop:propertyName>domain_name</prop:propertyName>
                     <prop:propertyName>discovered_os_name</prop:propertyName>
                  </prop:propertiesList>
                  <!--Optional:-->
               </prop:properties>
            </prop:typedProperties>
            <prop:typedProperties>
               <prop:type>installed_software</prop:type>
               <prop:properties>
                  <!--Optional:-->
                  <prop:propertiesList>
                     <!--1 or more repetitions:-->
                     <prop:propertyName>display_label</prop:propertyName>
                     <prop:propertyName>name</prop:propertyName>
                     <prop:propertyName>comments</prop:propertyName>
                     <prop:propertyName>discovered_vendor</prop:propertyName>
                     <prop:propertyName>file_system_path</prop:propertyName>
                     <prop:propertyName>installation_date</prop:propertyName>
                     <prop:propertyName>software_productcode</prop:propertyName>
                     <prop:propertyName>version</prop:propertyName>
                  </prop:propertiesList>
                  <!--Optional:-->
               </prop:properties>
            </prop:typedProperties>
            <prop:typedProperties>
               <prop:type>windows_service</prop:type>
               <prop:properties>
                  <!--Optional:-->
                  <prop:propertiesList>
                     <!--1 or more repetitions:-->
                     <prop:propertyName>display_label</prop:propertyName>
                     <prop:propertyName>name</prop:propertyName>  
                     <prop:propertyName>service_commandline</prop:propertyName>   
				 <prop:propertyName>service_description</prop:propertyName> 
				 <prop:propertyName>service_operatingstatus</prop:propertyName>
  				 <prop:propertyName>service_startuser</prop:propertyName>
  				 <prop:propertyName>service_pathtoexec</prop:propertyName>  
  				 <prop:propertyName>service_starttype</prop:propertyName>   	
  				 <prop:propertyName>service_name</prop:propertyName>     				 			 				 
                  </prop:propertiesList>
                  <!--Optional:-->
               </prop:properties>
            </prop:typedProperties>
            <prop:typedProperties>
               <prop:type>ip_address</prop:type>
               <prop:properties>
                  <!--Optional:-->
                  <prop:propertiesList>
                     <!--1 or more repetitions:-->
                     <prop:propertyName>display_label</prop:propertyName>
                     <prop:propertyName>authoritative_dns_name</prop:propertyName>
                     <prop:propertyName>ip_netaddr</prop:propertyName>
                     <prop:propertyName>ip_netclass</prop:propertyName>
                     <prop:propertyName>ip_netmask</prop:propertyName>
                     <prop:propertyName>ip_address_property</prop:propertyName>
                     <prop:propertyName>ip_address_type</prop:propertyName>
                     <prop:propertyName>ip_address_value</prop:propertyName>
                     <prop:propertyName>name</prop:propertyName>  
                  </prop:propertiesList>
                  <!--Optional:-->
               </prop:properties>
            </prop:typedProperties>
            <prop:typedProperties>
               <prop:type>running_software</prop:type>
               <prop:properties>
                  <!--Optional:-->
                  <prop:propertiesList>
                     <!--1 or more repetitions:-->
                     <prop:propertyName>display_label</prop:propertyName>
                     <prop:propertyName>name</prop:propertyName>  
                     <prop:propertyName>application_ip</prop:propertyName>
                     <prop:propertyName>root_container_name</prop:propertyName>
                     <prop:propertyName>discovered_product_name</prop:propertyName>
                     <prop:propertyName>software_edition</prop:propertyName>
                     <prop:propertyName>vendor</prop:propertyName>
                     <prop:propertyName>version</prop:propertyName>
                  </prop:propertiesList>
                  <!--Optional:-->
               </prop:properties>
            </prop:typedProperties>  
            <prop:typedProperties>
               <prop:type>device_driver</prop:type>
               <prop:properties>
                  <!--Optional:-->
                  <prop:propertiesList>
                     <!--1 or more repetitions:-->
                     <prop:propertyName>display_label</prop:propertyName>
                     <prop:propertyName>description</prop:propertyName>                     
                  </prop:propertiesList>
                  <!--Optional:-->
               </prop:properties>
            </prop:typedProperties>
            <prop:typedProperties>
               <prop:type>ip_service_endpoint</prop:type>
               <prop:properties>
                  <!--Optional:-->
                  <prop:propertiesList>
                     <!--1 or more repetitions:-->
                     <prop:propertyName>display_label</prop:propertyName>
                     <prop:propertyName>network_port_number</prop:propertyName>
                     <prop:propertyName>bound_to_ip_address</prop:propertyName>
                     <prop:propertyName>bound_to_ip_address_type</prop:propertyName>
                     <prop:propertyName>ip_service_name</prop:propertyName>
                     <prop:propertyName>port_name</prop:propertyName>
                     <prop:propertyName>ipserver_address</prop:propertyName>
                     <prop:propertyName>ipserver_name</prop:propertyName>
                     <prop:propertyName>ipserver_banner</prop:propertyName>
                     <prop:propertyName>ipserver_clients</prop:propertyName>                     
                  </prop:propertiesList>
                  <!--Optional:-->
               </prop:properties>
            </prop:typedProperties> 
            <prop:typedProperties>
               <prop:type>file_system</prop:type>
               <prop:properties>
                  <!--Optional:-->
                  <prop:propertiesList>
                     <!--1 or more repetitions:-->
                     <prop:propertyName>display_label</prop:propertyName>
                     <prop:propertyName>name</prop:propertyName>
                     <prop:propertyName>disk_size</prop:propertyName>
                     <prop:propertyName>filesystem_type</prop:propertyName>
                     <prop:propertyName>free_space</prop:propertyName>
                     <prop:propertyName>mount_point</prop:propertyName>
                     <prop:propertyName>disk_type</prop:propertyName>
                  </prop:propertiesList>
                  <!--Optional:-->
               </prop:properties>
            </prop:typedProperties>                                                                           
            <prop:typedProperties>
               <prop:type>winosuser</prop:type>
               <prop:properties>
                  <!--Optional:-->
                  <prop:propertiesList>
                     <!--1 or more repetitions:-->
                     <prop:propertyName>display_label</prop:propertyName>
                     <prop:propertyName>name</prop:propertyName>
                     <prop:propertyName>data_note</prop:propertyName>
                     <prop:propertyName>winosuser_domain</prop:propertyName>
                     <prop:propertyName>winosuser_full_name</prop:propertyName>
                     <prop:propertyName>winosuser_isdisabled</prop:propertyName>
                     <prop:propertyName>winosuser_islocal</prop:propertyName>
                     <prop:propertyName>winosuser_islocked</prop:propertyName>                     
                  </prop:propertiesList>
                  <!--Optional:-->
               </prop:properties>
            </prop:typedProperties>                                                                           
            <prop:typedProperties>
               <prop:type>business_application</prop:type>
               <prop:properties>
                  <!--Optional:-->
                  <prop:propertiesList>
                     <!--1 or more repetitions:-->
                     <prop:propertyName>display_label</prop:propertyName>
                     <prop:propertyName>name</prop:propertyName>
                     <prop:propertyName>deploy_type</prop:propertyName>
                  </prop:propertiesList>
                  <!--Optional:-->
               </prop:properties>
            </prop:typedProperties>                     			
         </quer:queryTypedProperties>         
      </quer:executeTopologyQueryByName>
   </soapenv:Body>
</soapenv:Envelope>